using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

// C#은 굉장히 고지식한 객체지향 언어
// C#은 클래스의 노예
// 모든 길은 클래스로 통한다
// 다른 언어들은 안그런 녀석들도 있는데 C#이란 언어는 
// 클래스를 설명하지 않고는 다른 걸 설명한다는 것이 의미가 없는 수준

// 게임이란 것은 굉장히 다양한 개념들을 품고있다.

// 직업
// 레벨
// 스킬
// 체력
// 마나
// 퀘스트
// 몬스터
// 무기
// 펫

// 객체지향은 저 중에서 적절히 묶어서 클래스화라는 것을 시킨다.
// 객체지향 프로그래밍의 가장 핵심적인 내용

// class(클래스를 선언하기 위한 키워드) 이름
// { <- 클래스의 내용의 시작.
// }

// 객체지향 -> 내가 표현하고 싶은걸 클래스로 만들어서ㅡ
// 그 클래스로 객체를 만드는 프로그래밍이다.
// 객체를 기반으로 모든걸 해결하기 떄문에
// 객체를 지향(향한다)할 수 밖에 없는 프로그래밍

// 숙련된 프로그래머는 구현과 개념이 분리되지 않지만
// 우리는 일단 내용을 생각하지 말고, 클래스를 먼저 만든다
// 이것이 객체지향


class Monster
{
    // 내부의 내용은 중요하지 않다,
}

class Pet
{
    // 내부의 내용은 중요하지 않다, 시작은 클래스부터
}